#include <iostream>
using namespace std;

int main()
{
    int a;
    int mass[3][2] {};
    for (int i = 0; i < 2; i++)
        mass[i][i] = rand() % 10;
    cout << mass[0][0] << "\n";
    cout << mass[0][1] << "\n";
    cout << mass[1][0] << "\n";
    cout << mass[1][1] << "\n";
    cout << mass[2][0] << "\n";
    cout << mass[2][1] << "\n";
    if (mass[0][0] > 0 or mass[0][1] > 0)
    {
        cout << "есть положительные в 1 строке" << "\n";
    }
    else
    {
        cout << "нет положительных в 1 строке" << "\n";
    }
    if (mass[1][0] > 0 or mass[1][1] > 0)
    {
        cout << "есть положительные в 2 строке" << "\n";
    }
    else
    {
        cout << "нет положительных в 2 строке" << "\n";
    }
    if (mass[2][0] > 0 or mass[2][1] > 0)
    {
        cout << "есть положительные в 3 строке" << "\n";
    }
    else
    {
        cout << "нет положительных в 3 строке" << "\n";
    }
    cout << "Введите a: ";
    cin >> a;
    if (mass[0][0] % 10 == a or mass[0][1] % 10 == a)
    {
        cout << "есть элементы, последняя цифра которых равна а в 1 строке" << "\n";
    }
    else
    {
        cout << "нет элементов, последняя цифра которых равна а в 1 строке" << "\n";
    }
    if (mass[1][0] % 10 == a or mass[1][1] % 10 == a)
    {
        cout << "есть элементы, последняя цифра которых равна а во 2 строке" << "\n";
    }
    else
    {
        cout << "нет элементов, последняя цифра которых равна а во 2 строке" << "\n";
    }
    if (mass[2][0] % 10 == a or mass[2][1] % 10 == a)
    {
        cout << "есть элементы, последняя цифра которых равна а в 3 строке" << "\n";
    }
    else
    {
        cout << "нет элементов, последняя цифра которых равна а в 3 строке" << "\n";
    }
    return 0;
}